MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX120F064H.PIC
      <edc:SFRDef edc:_addr="0x1F886540" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="5" edc:access="-------------------------nnnnnnn" edc:cname="ODCF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff007f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------0000000" edc:name="ODCF" edc:nzwidth="0x20" edc:por="-------------------------0000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCF0" edc:desc="" edc:mask="0x1" edc:name="ODCF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF1" edc:desc="" edc:mask="0x1" edc:name="ODCF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF2" edc:desc="" edc:mask="0x1" edc:name="ODCF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF3" edc:desc="" edc:mask="0x1" edc:name="ODCF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF4" edc:desc="" edc:mask="0x1" edc:name="ODCF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF5" edc:desc="" edc:mask="0x1" edc:name="ODCF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF6" edc:desc="" edc:mask="0x1" edc:name="ODCF6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886550" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="5" edc:access="-------------------------nnnnnnn" edc:cname="CNPUF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff007f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------xxxxxxx" edc:name="CNPUF" edc:nzwidth="0x20" edc:por="-------------------------xxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUF0" edc:desc="" edc:mask="0x1" edc:name="CNPUF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF1" edc:desc="" edc:mask="0x1" edc:name="CNPUF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF2" edc:desc="" edc:mask="0x1" edc:name="CNPUF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF3" edc:desc="" edc:mask="0x1" edc:name="CNPUF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF4" edc:desc="" edc:mask="0x1" edc:name="CNPUF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF5" edc:desc="" edc:mask="0x1" edc:name="CNPUF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF6" edc:desc="" edc:mask="0x1" edc:name="CNPUF6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886560" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="5" edc:access="-------------------------nnnnnnn" edc:cname="CNPDF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff007f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------xxxxxxx" edc:name="CNPDF" edc:nzwidth="0x20" edc:por="-------------------------xxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDF0" edc:desc="" edc:mask="0x1" edc:name="CNPDF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDF1" edc:desc="" edc:mask="0x1" edc:name="CNPDF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDF2" edc:desc="" edc:mask="0x1" edc:name="CNPDF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDF3" edc:desc="" edc:mask="0x1" edc:name="CNPDF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDF4" edc:desc="" edc:mask="0x1" edc:name="CNPDF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDF5" edc:desc="" edc:mask="0x1" edc:name="CNPDF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDF6" edc:desc="" edc:mask="0x1" edc:name="CNPDF6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886570" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="5" edc:access="----------------n-n-------------" edc:cname="CNCONF" edc:desc="" edc:grp="PORTF" edc:impl="0xffffbfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000-00000000000000" edc:name="CNCONF" edc:nzwidth="0x20" edc:por="00000000000000000-00000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="13"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886580" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="5" edc:access="-------------------------nnnnnnn" edc:cname="CNENF" edc:desc="" edc:grp="PORTF" edc:impl="0xffc0007f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000---------------xxxxxxx" edc:name="CNENF" edc:nzwidth="0x20" edc:por="0000000000---------------xxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEF0" edc:desc="" edc:mask="0x1" edc:name="CNIEF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF1" edc:desc="" edc:mask="0x1" edc:name="CNIEF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF2" edc:desc="" edc:mask="0x1" edc:name="CNIEF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF3" edc:desc="" edc:mask="0x1" edc:name="CNIEF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF4" edc:desc="" edc:mask="0x1" edc:name="CNIEF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF5" edc:desc="" edc:mask="0x1" edc:name="CNIEF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF6" edc:desc="" edc:mask="0x1" edc:name="CNIEF6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F886590" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="5" edc:access="-------------------------nnnnnnn" edc:cname="CNSTATF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff007f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------xxxxxxx" edc:name="CNSTATF" edc:nzwidth="0x20" edc:por="-------------------------xxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATF0" edc:desc="" edc:mask="0x1" edc:name="CNSTATF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF1" edc:desc="" edc:mask="0x1" edc:name="CNSTATF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF2" edc:desc="" edc:mask="0x1" edc:name="CNSTATF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF3" edc:desc="" edc:mask="0x1" edc:name="CNSTATF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF4" edc:desc="" edc:mask="0x1" edc:name="CNSTATF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF5" edc:desc="" edc:mask="0x1" edc:name="CNSTATF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF6" edc:desc="" edc:mask="0x1" edc:name="CNSTATF6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8865A0" edc:offset="96"/>
      <edc:SFRDef edc:_addr="0x1F886600" edc:_begin="0x0" edc:_end="0xa0" edc:_modsrc="DOS-02495_TRAN_Ports.Module" edc:_refcount="6" edc:access="----------------------nnnn------" edc:cname="ANSELG" edc:desc="" edc:grp="PORTG" edc:impl="0xffff03c0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------xxxx------" edc:name="ANSELG" edc:nzwidth="0x20" edc:por="----------------------xxxx------" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSG6" edc:desc="" edc:mask="0x1" edc:name="ANSG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSG7" edc:desc="" edc:mask="0x1" edc:name="ANSG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSG8" edc:desc="" edc:mask="0x1" edc:name="ANSG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSG9" edc:desc="" edc:mask="0x1" edc:name="ANSG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
